<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Identifier</key>
    <string>org.ef.autopkg.AutoPkg.munki</string>
    <key>Input</key>
    <dict>
        <key>CATALOG</key>
        <string>testing</string>
        <key>MUNKI_PKGINFO_FILE_EXTENSION</key>
        <string></string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string></string>
        <key>NAME</key>
        <string>AutoPkg</string>
        <key>RELEASE_NOTES_URL</key>
        <string>https://github.com/autopkg/autopkg/releases/</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>%CATALOG%</string>
            </array>
            <key>category</key>
            <string>Munki Tools</string>
            <key>description</key>
            <string>Automating packaging and software distribution on OS X
&lt;br /&gt;&lt;a href="%RELEASE_NOTES_URL%"&gt;Release Notes&lt;/a&gt;</string>
            <key>developer</key>
            <string>autopkg</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>notes</key>
            <string>-- Packaged by autopkg</string>
            <key>unattended_install</key>
            <false/>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.hewei100.AutoPkg.munki</string>
</dict>
</plist>
