<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>org.ef.autopkg.TheUnarchiver.munki</string>
	<key>Input</key>
	<dict>
		<key>CATALOG</key>
		<string>testing</string>
		<key>MUNKI_PKGINFO_FILE_EXTENSION</key>
		<string></string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>TheUnarchiver</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>%CATALOG%</string>
			</array>
			<key>description</key>
			<string>The Unarchiver is a much more capable replacement for "Archive Utility.app", the built-in archive unpacker program on Mac OS X. The Unarchiver is designed to handle many more formats than Archive Utility, and to better fit in with the design of the Finder.</string>
			<key>display_name</key>
			<string>The Unarchiver</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>notes</key>
			<string>-- Packaged by autopkg</string>
			<key>unattended_install</key>
			<false/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.TheUnarchiver</string>
</dict>
</plist>
