<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>org.ef.autopkg.munki.BetterZipQL</string>
	<key>Input</key>
	<dict>
		<key>CATALOG</key>
		<string>testing</string>
		<key>DOWNLOAD_PAGE_URL</key>
		<string>http://macitbetter.com/BetterZip-Quick-Look-Generator/</string>
		<key>MUNKI_PKGINFO_FILE_EXTENSION</key>
		<string></string>
		<key>MUNKI_REPO_SUBDIRECTORY</key>
		<string></string>
		<key>NAME</key>
		<string>BetterZipQL</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>%CATALOG%</string>
			</array>
			<key>description</key>
			<string>Wouldn't it be great if Mac OS X's Quick Look would let you inspect the contents of compressed archives? With the help of the BetterZip Quick Look Generator, it can.
The currently supported archive formats are: ZIP, TAR, GZip, BZip2, ARJ, LZH, ISO, CHM, CAB, CPIO, RAR, 7-Zip, DEB, RPM, StuffIt's SIT, DiskDoubler, BinHex, and MacBinary.</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>notes</key>
			<string>-- Packaged by autopkg
Source: %DOWNLOAD_PAGE_URL%
</string>
			<key>postinstall_script</key>
			<string>#!/bin/bash
PATH=/bin:/sbin:/usr/bin:/usr/sbin
console_uid="$(stat -f "%u" /dev/console)"
if [[ -n "$console_uid" &amp;&amp; $console_uid -ne 0 ]]; then
    console_user="$(id -un $console_uid)"
    sudo -u $console_user /usr/bin/qlmanage -r
fi
exit 0
</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash
PATH=/bin:/sbin:/usr/bin:/usr/sbin
console_uid="$(stat -f "%u" /dev/console)"
if [[ -n "$console_uid" &amp;&amp; $console_uid -ne 0 ]]; then
    console_user="$(id -un $console_uid)"
    sudo -u $console_user /usr/bin/qlmanage -r
fi
exit 0
</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jps3.munki.BetterZipQL</string>
</dict>
</plist>
