<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>org.ef.autopkg.DeployStudioAdmin.munki</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_PKGINFO_FILE_EXTENSION</key>
		<string></string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>DeployStudioAdmin</string>
	</dict>
	<!-- gave up overriding pkginfo unattended_(un)install keys -->
	<key>ParentRecipe</key>
	<string>com.github.jaharmi.munki.DeployStudioAdmin</string>
</dict>
</plist>
