<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>org.ef.autopkg.AdobeShockwavePlayer.munki</string>
	<key>Input</key>
	<dict>
		<key>CATALOG</key>
		<string>testing</string>
		<key>DOWNLOAD_URL</key>
		<string>http://fpdownload.macromedia.com/get/shockwave/default/english/macosx/latest/Shockwave_Installer_Full_64bit.dmg</string>
		<key>MUNKI_PKGINFO_FILE_EXTENSION</key>
		<string></string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string></string>
		<key>NAME</key>
		<string>AdobeShockwavePlayer</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>%CATALOG%</string>
			</array>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>notes</key>
			<string>-- Packaged by autopkg
Source: %DOWNLOAD_URL%
</string>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.jleggat.AdobeShockwavePlayer.munki</string>
</dict>
</plist>
