<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Adobe Flash Player installer, imports into Munki, based on import-flashplayer 1.6.
Archived versions: http://helpx.adobe.com/flash-player/kb/archived-flash-player-versions.html</string>
    <key>Identifier</key>
    <string>org.ef.autopkg.AdobeFlashPlayer.munki</string>
    <key>Input</key>
    <dict>
        <key>CATALOG</key>
        <string>testing</string>
        <key>MAKEPKGINFO_PKGNAME</key>
        <string>Install Adobe Flash Player.app/Contents/Resources/Adobe Flash Player.pkg</string>
        <key>MUNKI_PKGINFO_FILE_EXTENSION</key>
        <string></string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string></string>
        <key>NAME</key>
        <string>AdobeFlashPlayer</string>
        <key>RELEASE_NOTES_URL</key>
        <string>http://helpx.adobe.com/flash-player/flash-player-releasenotes.html</string>
        <key>pkginfo</key>
        <dict>
			<key>category</key>
			<string>Browser Plugin</string>
            <key>description</key>
            <string>Adobe® Flash® Player is a cross-platform browser-based application runtime that delivers uncompromised viewing of expressive applications, content, and videos across screens and browsers.
&lt;br /&gt;&lt;a href="%RELEASE_NOTES_URL%"&gt;Release Notes&lt;/a&gt;</string>
			<key>developer</key>
			<string>Adobe</string>
            <key>display_name</key>
            <string>Adobe Flash Player</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
            <key>blocking_applications</key>
            <array>
               <string>Safari.app</string>
               <string>Firefox.app</string>
               <string>Opera.app</string>
            </array>
            <key>minimum_munki_version</key>
            <string>0.9.2.1856</string>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.FlashPlayer</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>catalogs</key>
                    <array>
                        <string>%CATALOG%</string>
                    </array>
                    <key>notes</key>
                    <string>-- Packaged by autopkg
Source: %url%
with default settings to disable auto-update</string>
                    <key>postinstall_script</key>
                    <string>#!/bin/bash

D="/Library/Application Support/Macromedia"
[ ! -d "$D" ] &amp;&amp; mkdir -p "$D"
cd "$D"
[ -e "mms.cfg" ] &amp;&amp;
  sed -E -i '' '/^(AutoUpdateDisable|SilentAutoUpdateEnable)=/d' mms.cfg
echo "AutoUpdateDisable=1
SilentAutoUpdateEnable=0" &gt;&gt; mms.cfg
chown -R root:wheel .
exit 0
</string>
                    <key>postuninstall_script</key>
                    <string>#!/bin/bash

rm -rf "/Library/Internet Plug-Ins/Flash Player.plugin"
exit 0
</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>munkiimport_pkgname</key>
                <string>%MAKEPKGINFO_PKGNAME%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
